In [1]:
import pandas

In [3]:
dataset = {
    " names" : ["Ali","zahid","Aamir","Mashooque"],
    "ID" :[1,2,3,5]
}
x = pandas.DataFrame(dataset)
print(x)

       names  ID
0        Ali   1
1      zahid   2
2      Aamir   3
3  Mashooque   5

In [10]:
# Simple Example of series in pandas
import pandas as pd
num = [1 ,2, 3]
x = pd.Series(num)
print(x)

0    1
1    2
2    3
dtype: int64

In [11]:
print(x[1])

2

In [24]:
#series with a idex form 

a = [1, 3, 2]
x = pd.Series(a ,index = ["khan","bhai","Babo"])
print(x)

khan    1
bhai    3
Babo    2
dtype: int64

In [25]:
#Create a simple Pandas Series from a dictionary:
names = { 'khan': 13 ,'Ali':16,'python':100}
v = pd.Series(names)
print(v)

khan       13
Ali        16
python    100
dtype: int64

In [31]:
# Create the Dataframe ans load the data set 
data = { 
    'id':[11, 12, 13, 14, 15],
    'name':["Ali","Aamir","ali bus","Babar","irfan"],
    
    'marks':[45,69,78,89,90]
}
# load the data set
d = pd.DataFrame(data)
print(d)

   id     name  marks
0  11      Ali     45
1  12    Aamir     69
2  13  ali bus     78
3  14    Babar     89
4  15    irfan     90

In [32]:
# load the dataframe  through csv file 
df = pd.read_csv('salaries.csv')
df

       company                  job     degree  salary_more_then_100k
0       google      sales executive  bachelors                      0
1       google      sales executive    masters                      0
2       google     business manager  bachelors                      1
3       google     business manager    masters                      1
4       google  computer programmer  bachelors                      0
5       google  computer programmer    masters                      1
6   abc pharma      sales executive    masters                      0
7   abc pharma  computer programmer  bachelors                      0
8   abc pharma     business manager  bachelors                      0
9   abc pharma     business manager    masters                      1
10    facebook      sales executive  bachelors                      1
11    facebook      sales executive    masters                      1
12    facebook     business manager  bachelors                      1
13    facebook     business manager    masters                      1
14    facebook  computer programmer  bachelors                      1
15    facebook  computer programmer    masters                      1

In [33]:
df = pd.read_csv('salaries.csv')
print(df.to_string())

       company                  job     degree  salary_more_then_100k
0       google      sales executive  bachelors                      0
1       google      sales executive    masters                      0
2       google     business manager  bachelors                      1
3       google     business manager    masters                      1
4       google  computer programmer  bachelors                      0
5       google  computer programmer    masters                      1
6   abc pharma      sales executive    masters                      0
7   abc pharma  computer programmer  bachelors                      0
8   abc pharma     business manager  bachelors                      0
9   abc pharma     business manager    masters                      1
10    facebook      sales executive  bachelors                      1
11    facebook      sales executive    masters                      1
12    facebook     business manager  bachelors                      1
13    facebook     business manager    masters                      1
14    facebook  computer programmer  bachelors                      1
15    facebook  computer programmer    masters                      1